In [19]:
import pandas as pd

In [20]:
data=pd.read_csv("train.csv")

In [21]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Cabin        202 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.5+ KB

## *Encoding of categorical variables*

In [23]:
from sklearn.preprocessing import LabelEncoder
encoder=LabelEncoder()

In [24]:
data['Sex']=encoder.fit_transform(data['Sex'])
data['Embarked']=encoder.fit_transform(data['Embarked'])

In [25]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2

## *Check for null values*

In [26]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

## *Dropping of irrelevant features*

In [27]:
data=data.drop(['Cabin','PassengerId','Name','Ticket'],axis=1)
data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

## Model 1

In [28]:
#Splitting the dataset
y=data.iloc[:,1:2]
y.head()

   Pclass
0       3
1       1
2       3
3       1
4       3

In [29]:
x=data.drop(["Pclass"],axis=1)
x.head()

   Survived  Sex   Age  SibSp  Parch     Fare  Embarked
0         0    1  22.0      1      0   7.2500         2
1         1    0  38.0      1      0  71.2833         0
2         1    0  26.0      0      0   7.9250         2
3         1    0  35.0      1      0  53.1000         2
4         0    1  35.0      0      0   8.0500         2

In [30]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)

## Training the model

In [31]:
from sklearn.naive_bayes import BernoulliNB
clf=BernoulliNB()

In [32]:
y_pred=clf.fit(x_train,y_train).predict(x_test)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:73: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

## Calculate performance metrics of the model

In [33]:
from sklearn.metrics import accuracy_score,confusion_matrix

In [34]:
print("The accuracy score is:",accuracy_score(y_test,y_pred,normalize=True))

The accuracy score is: 0.5917602996254682

In [35]:
print("The confusion matrix is:")
print(confusion_matrix(y_test,y_pred))

The confusion matrix is:
[[ 30   8  32]
 [  9  10  30]
 [ 24   6 118]]

## Conclusion

In [0]:
Out of total 267 records only 158 are successfully classified, giving a model accuracy of 59%.

## Model 2

In [36]:
#Splitting the dataset
y=data.iloc[:,1:2]
y.head()

   Pclass
0       3
1       1
2       3
3       1
4       3

In [37]:
x=data.drop(["Sex"],axis=1)
x.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  Embarked
0         0       3  22.0      1      0   7.2500         2
1         1       1  38.0      1      0  71.2833         0
2         1       3  26.0      0      0   7.9250         2
3         1       1  35.0      1      0  53.1000         2
4         0       3  35.0      0      0   8.0500         2

In [38]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)

## Training the model

In [41]:
from sklearn.naive_bayes import BernoulliNB
clf=BernoulliNB()

In [42]:
y_pred=clf.fit(x_train,y_train).predict(x_test)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:73: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

## Calculate performance metrics of the model

In [43]:
from sklearn.metrics import accuracy_score,confusion_matrix

In [44]:
print("The accuracy score is:",accuracy_score(y_test,y_pred,normalize=True))

The accuracy score is: 0.6142322097378277

In [45]:
print("The confusion matrix is:")
print(confusion_matrix(y_test,y_pred))

The confusion matrix is:
[[ 26   8  36]
 [  3   7  39]
 [ 12   5 131]]

## Conclusion

In [0]:
Out of total 267 records only 164 are successfully classified, giving a model accuracy of 61%.

## Model 3

In [46]:
#Splitting the dataset
y=data.iloc[:,4:5]
y.head()

   SibSp
0      1
1      1
2      0
3      1
4      0

In [47]:
x=data.drop(["SibSp"],axis=1)
x.head()

   Survived  Pclass  Sex   Age  Parch     Fare  Embarked
0         0       3    1  22.0      0   7.2500         2
1         1       1    0  38.0      0  71.2833         0
2         1       3    0  26.0      0   7.9250         2
3         1       1    0  35.0      0  53.1000         2
4         0       3    1  35.0      0   8.0500         2

In [48]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)

## Training the model

In [49]:
from sklearn.naive_bayes import BernoulliNB
clf=BernoulliNB()

In [50]:
y_pred=clf.fit(x_train,y_train).predict(x_test)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:73: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

## Calculate performance metrics of the model

In [51]:
from sklearn.metrics import accuracy_score,confusion_matrix

In [52]:
print("The accuracy score is:",accuracy_score(y_test,y_pred,normalize=True))

The accuracy score is: 0.6891385767790262

In [53]:
print("The confusion matrix is:")
print(confusion_matrix(y_test,y_pred))

The confusion matrix is:
[[162  20   0   0   0   0   0]
 [ 43  22   0   0   0   0   0]
 [  6   2   0   0   0   0   0]
 [  5   2   0   0   0   0   0]
 [  2   0   0   0   0   0   0]
 [  1   0   0   0   0   0   0]
 [  2   0   0   0   0   0   0]]

## Conclusion

In [0]:
Out of total 267 records only 184 are successfully classified, giving a model accuracy of 68%.

## Model 4

In [54]:
#Splitting the dataset
y=data.iloc[:,5:6]
y.head()

   Parch
0      0
1      0
2      0
3      0
4      0

In [55]:
x=data.drop(["Parch"],axis=1)
x.head()

   Survived  Pclass  Sex   Age  SibSp     Fare  Embarked
0         0       3    1  22.0      1   7.2500         2
1         1       1    0  38.0      1  71.2833         0
2         1       3    0  26.0      0   7.9250         2
3         1       1    0  35.0      1  53.1000         2
4         0       3    1  35.0      0   8.0500         2

In [56]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)

## Training the model

In [57]:
from sklearn.naive_bayes import BernoulliNB
clf=BernoulliNB()

In [58]:
y_pred=clf.fit(x_train,y_train).predict(x_test)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:73: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

## Calculate performance metrics of the model

In [59]:
from sklearn.metrics import accuracy_score,confusion_matrix

In [60]:
print("The accuracy score is:",accuracy_score(y_test,y_pred,normalize=True))

The accuracy score is: 0.7153558052434457

In [61]:
print("The confusion matrix is:")
print(confusion_matrix(y_test,y_pred))

The confusion matrix is:
[[182  16   0   0   0]
 [ 31   9   0   0   0]
 [ 24   3   0   0   0]
 [  1   0   0   0   0]
 [  1   0   0   0   0]]

## Conclusion

In [0]:
Out of total 267 records only 191 are successfully classified, giving a model accuracy of 71%.

## Model 5

In [62]:
#Splitting the dataset
y=data.iloc[:,7:]
y.head()

   Embarked
0         2
1         0
2         2
3         2
4         2

In [63]:
x=data.drop(["Embarked"],axis=1)
x.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    1  22.0      1      0   7.2500
1         1       1    0  38.0      1      0  71.2833
2         1       3    0  26.0      0      0   7.9250
3         1       1    0  35.0      1      0  53.1000
4         0       3    1  35.0      0      0   8.0500

In [64]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)

## Training the model

In [65]:
from sklearn.naive_bayes import BernoulliNB
clf=BernoulliNB()

In [66]:
y_pred=clf.fit(x_train,y_train).predict(x_test)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:73: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

## Calculate performance metrics of the model

In [67]:
from sklearn.metrics import accuracy_score,confusion_matrix

In [68]:
print("The accuracy score is:",accuracy_score(y_test,y_pred,normalize=True))

The accuracy score is: 0.7340823970037453

In [69]:
print("The confusion matrix is:")
print(confusion_matrix(y_test,y_pred))

The confusion matrix is:
[[  0   0  49]
 [  0   0  22]
 [  0   0 196]]

## Conclusion

In [0]:
Out of total 267 records only 196 are successfully classified, giving a model accuracy of 73%.